#include "fu_icmp.h"
#include <string.h>
#include "fu_config.h"
/*********************************************************************/
/* 本程序仅供学习参考，未经作者允许，不得用于任何商业用途            */
/* FuIP专为单片机而定制的TCP/IP协议栈，适用于任何8,16,32位单片机     */
/* 主程序，可用于客户端，服务端    					            	 */
/* 技术论坛：www.fuhome.net/bbs/						             */
/* 移植请注意，此程序使用硬件SPI，模拟SPI会有区别，本程序默认是模拟  */
/* 发送各种数据报程序，ARP DHCP Ping TCP（服务端/客户端） UDP        */
/* FuIP可用于，客户/服务，不限连接数，亦可接入fuhome.net 平台进行远程控制*/
/* 版本：v3.1 2018年7月23日						                     */
/* 龙剑奋斗	乘简									       		     */
/* 定期更新，敬请关注——开放，交流，深入，进步	     			     */
/* Copyright fuhome.net 未来之家 实验室，让科技融入生活				 */
/*********************************************************************/


//类型主ping80 回ping 00 ，检验和2，标识符2，序号2，数据
U8 xdata ICMP[40]={0,0,0,0};
U16 xdata ICMP_Mark=0x0000;//ICMP的序号字段
///*******************************************/
///* 功能：ICMP 主ping数据填充  	      	   */
///* 输入：无   				               */
///* 输出：无							       */
///*******************************************/
//void ICMP_Ping_Copy(void)
//{
//	U8 i;
//	ICMP[0]=0x08;//主ping
//	ICMP[1]=0;//
//	ICMP[2]=0;
//	ICMP[3]=0;//检验和
//	ICMP[4]=0x00;//自定义
//	ICMP[5]=0x01;//自定义
//	ICMP_Mark++;//标示字段+1，唯一字段
//	if(ICMP_Mark==0xffff)
//		ICMP_Mark=0x0000;
//	ICMP[6]=ICMP_Mark>>8;//
//	ICMP[7]=ICMP_Mark;//序号
//	
//	for(i=0;i<23;i++)
//		ICMP[8+i]='a'+i;//任意内容
//	for(i=0;i<9;i++)
//		ICMP[31+i]='a'+i;//任意内容
//}

/*******************************************/
/* 功能：ICMP 回ping数据填充  	      	   */
/* 输入：无   				               */
/* 输出：无							       */
/*******************************************/
void ICMP_Ping_Answer(void)
{
	memcpy(ICMP,&DATA[34],40);//ping
	ICMP[0]=0;//回ping标志
	ICMP[2]=0;
	ICMP[3]=0;//检验和
}


/********************************************/
/* 功能：检验和处理函数           			*/
/* 输入：无									*/
/* 输出：16位ICMP检验和						*/
/********************************************/

U16 ICMP_Check_Code(void)
{
    U32 tem;
	tem=FU_Check_Sum((U16 xdata *)ICMP,40);//累加总和
    return FU_Check_Code(tem);//计算溢出位
}

///********************************************/
///* 功能：组ICMP_Ping_Send数据包函数       	*/
///* 输入：无									*/
///* 输出：无									*/
///********************************************/
//void ICMP_Ping_Send(void)
//{
//	U16 tem;
//	//填充ICMP 40
//	ICMP_Ping_Copy();//组包
//	tem=ICMP_Check_Code();//得到检验和
//	ICMP[2]=tem>>8;
//	ICMP[3]=tem;//检验和稍后补充
//}

/********************************************/
/* 功能：组ICMP_Ping_Answer_Send数据包函数  */
/* 输入：无									*/
/* 输出：无									*/
/********************************************/

void ICMP_Ping_Answer_Send(void)
{
	U16 tem;
	//直接复制收到的ICMP 40
	ICMP_Ping_Answer();//组包
	tem=ICMP_Check_Code();//得到检验和
	ICMP[2]=tem>>8;
	ICMP[3]=tem;//检验和稍后补充
}

